#!/usr/bin/python3
# coding: utf-8

"""
This module is to define replaced table
"""


def convert_chinese_number(string):
    """
    Convert Chinese number to integer
    """
    return str(NUMBER.get(string)).zfill(2) if NUMBER.get(string) else string.zfill(2)


NUMBER = {
    '一': '1',
    '二': '2',
    '三': '3',
    '四': '4',
    '五': '5',
    '六': '6',
    '七': '7',
    '八': '8',
    '九': '9',
    '十': '10',
    '十一': '11',
    '十二': '12',
    '十三': '13',
    '十四': '14',
    '十五': '15',
    '十六': '16',
    '十七': '17',
    '十八': '18',
    '十九': '19',
    '二十': '20',
    '二十一': '21',
    '二十二': '22',
    '二十三': '23',
    '二十四': '24',
    '二十五': '25',
    '二十六': '26',
    '二十七': '27',
    '二十八': '28',
    '二十九': '29',
    '三十': '30',
    '三十一': '31',
    '三十二': '32',
    '三十三': '33',
    '三十四': '34',
    '三十五': '35',
    '三十六': '36',
    '三十七': '37',
    '三十八': '38',
    '三十九': '39',
    '四十': '40',
}
